data = {
    "ru" : {
        "arr_yes" : ["да", "конечно"],
        "arr_no" : ["нет", "не хочу"],
        "You" : "Вы",
        "get_user_name_text" : "Хэй, привет. Надеюсь не испугались начальной картинкой? Я Soaryoto и сегодня мы займемся вашими задачами. А с начала расскажу о себе чуть чуть. Для начала, с лева это не клякса, а картинка лисички Паппи, мне нравятся лисички) Так что ещё, люблю кофе, занимаюсь программированием. Всё, фантазия кончиться. А теперь можно узнать как зовут вас ?",
        "get_user_name_text_error" : "Вы неправельно ввели имя, повторите пожалуйста",
        "get_hello_user_with_name" : "Привет {}",
        "get_user_second_name_text" : "{}, мне нужна ваша фамилия чтобы я в дальнейшем вас не забыл, если же не хотите скажите",
        "answer_user_second_name_text_no" : "Ну хорошо, не буду вас запоминать",
        "get_user_second_name_text_error" : "Ммм, вы неправельно ввели фамилию",
        
        "get_task_1_text" : "Ок, задача 1 \"Pretty Print\". Милый ввывод? Чтот странно, ладно давай решать. Тут нужен массив, может вы придумаете предложение и я из него массив сделаю?",
        "get_task_1_text_no" : "Эх, придется мне придумывать",
        "get_task_1_text_error" : "Вы ввели не предложение",
        "get_task_1_text_result" : "Окей, у нас получается следующее:",

        
        "get_task_2_text" : "Хм, следующая задача называется \"Ввод-вывод\". Вы вписываете числа и я вывожу вам сумму чисел, а чтобы закончить введите число 0",
        "get_task_2_text_first" : "Хорошо, впишите первое число",
        "get_task_2_text_next" : "Дайте следующее число",
        "get_task_2_text_error" : "Число не так пишется",
        "get_task_2_text_result" : "Я сложил все введёные числа и получилось {}",
        "get_task_2_text_end_null" : "Не хотите как хотите",
        "get_task_2_text_end" : "В итоге получается {}. Окей, переходим к следующему заданию",
    },
    "en" : {
        "You" : "You"
    }
}